test/tests/timesteppers/foam_tstep_insert/buoyantCavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    topAndBottom
    {
        type            calculated;
        value           uniform 100000;
    }
    frontAndBack
    {
        type            calculated;
        value           uniform 100000;
    }
    hot
    {
        type            calculated;
        value           uniform 100000;
    }
    cold
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
